Revit 2026 API
TopographySurface.Create Method
Overload List
Name | Description
Create(Document, IList<XYZ>) | Obsolete.
Create(Document, IList<XYZ>, IList<PolymeshFacet>) | Obsolete.
Top
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace